MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV128GM002/mcu.h
#define _SENT2STAT_TXEN_POSITION                 0x00000000
#define _SENT2STAT_TXEN_MASK                     0x00000001
#define _SENT2STAT_TXEN_LENGTH                   0x00000001

#define _SENT2DATL_CRC_POSITION                  0x00000000
#define _SENT2DATL_CRC_MASK                      0x0000000F
#define _SENT2DATL_CRC_LENGTH                    0x00000004

#define _SENT2DATL_DATA6_POSITION                0x00000004
#define _SENT2DATL_DATA6_MASK                    0x000000F0
#define _SENT2DATL_DATA6_LENGTH                  0x00000004

#define _SENT2DATL_DATA5_POSITION                0x00000008
#define _SENT2DATL_DATA5_MASK                    0x00000F00
#define _SENT2DATL_DATA5_LENGTH                  0x00000004

#define _SENT2DATL_DATA4_POSITION                0x0000000C
#define _SENT2DATL_DATA4_MASK                    0x0000F000
#define _SENT2DATL_DATA4_LENGTH                  0x00000004

#define _SENT2DATL_CRC0_POSITION                 0x00000000
#define _SENT2DATL_CRC0_MASK                     0x00000001
#define _SENT2DATL_CRC0_LENGTH                   0x00000001

#define _SENT2DATL_CRC1_POSITION                 0x00000001
#define _SENT2DATL_CRC1_MASK                     0x00000002
#define _SENT2DATL_CRC1_LENGTH                   0x00000001

#define _SENT2DATL_CRC2_POSITION                 0x00000002
#define _SENT2DATL_CRC2_MASK                     0x00000004
#define _SENT2DATL_CRC2_LENGTH                   0x00000001

#define _SENT2DATL_CRC3_POSITION                 0x00000003
#define _SENT2DATL_CRC3_MASK                     0x00000008
#define _SENT2DATL_CRC3_LENGTH                   0x00000001

#define _SENT2DATL_DATA60_POSITION               0x00000004
#define _SENT2DATL_DATA60_MASK                   0x00000010
#define _SENT2DATL_DATA60_LENGTH                 0x00000001

#define _SENT2DATL_DATA61_POSITION               0x00000005
#define _SENT2DATL_DATA61_MASK                   0x00000020
#define _SENT2DATL_DATA61_LENGTH                 0x00000001

#define _SENT2DATL_DATA62_POSITION               0x00000006
#define _SENT2DATL_DATA62_MASK                   0x00000040
#define _SENT2DATL_DATA62_LENGTH                 0x00000001

#define _SENT2DATL_DATA63_POSITION               0x00000007
#define _SENT2DATL_DATA63_MASK                   0x00000080
#define _SENT2DATL_DATA63_LENGTH                 0x00000001

#define _SENT2DATL_DATA50_POSITION               0x00000008
#define _SENT2DATL_DATA50_MASK                   0x00000100
#define _SENT2DATL_DATA50_LENGTH                 0x00000001

#define _SENT2DATL_DATA51_POSITION               0x00000009
#define _SENT2DATL_DATA51_MASK                   0x00000200
#define _SENT2DATL_DATA51_LENGTH                 0x00000001

#define _SENT2DATL_DATA52_POSITION               0x0000000A
#define _SENT2DATL_DATA52_MASK                   0x00000400
#define _SENT2DATL_DATA52_LENGTH                 0x00000001

#define _SENT2DATL_DATA53_POSITION               0x0000000B
#define _SENT2DATL_DATA53_MASK                   0x00000800
#define _SENT2DATL_DATA53_LENGTH                 0x00000001

#define _SENT2DATL_DATA40_POSITION               0x0000000C
#define _SENT2DATL_DATA40_MASK                   0x00001000
#define _SENT2DATL_DATA40_LENGTH                 0x00000001

#define _SENT2DATL_DATA41_POSITION               0x0000000D
#define _SENT2DATL_DATA41_MASK                   0x00002000
#define _SENT2DATL_DATA41_LENGTH                 0x00000001

#define _SENT2DATL_DATA42_POSITION               0x0000000E
#define _SENT2DATL_DATA42_MASK                   0x00004000
#define _SENT2DATL_DATA42_LENGTH                 0x00000001

#define _SENT2DATL_DATA43_POSITION               0x0000000F
#define _SENT2DATL_DATA43_MASK                   0x00008000
#define _SENT2DATL_DATA43_LENGTH                 0x00000001

#define _SENT2DATH_DATA3_POSITION                0x00000000
#define _SENT2DATH_DATA3_MASK                    0x0000000F
#define _SENT2DATH_DATA3_LENGTH                  0x00000004

#define _SENT2DATH_DATA2_POSITION                0x00000004
#define _SENT2DATH_DATA2_MASK                    0x000000F0
#define _SENT2DATH_DATA2_LENGTH                  0x00000004

#define _SENT2DATH_DATA1_POSITION                0x00000008
#define _SENT2DATH_DATA1_MASK                    0x00000F00
#define _SENT2DATH_DATA1_LENGTH                  0x00000004

#define _SENT2DATH_STAT_POSITION                 0x0000000C
#define _SENT2DATH_STAT_MASK                     0x0000F000
#define _SENT2DATH_STAT_LENGTH                   0x00000004

#define _SENT2DATH_DATA30_POSITION               0x00000000
#define _SENT2DATH_DATA30_MASK                   0x00000001
#define _SENT2DATH_DATA30_LENGTH                 0x00000001

#define _SENT2DATH_DATA31_POSITION               0x00000001
#define _SENT2DATH_DATA31_MASK                   0x00000002
#define _SENT2DATH_DATA31_LENGTH                 0x00000001

#define _SENT2DATH_DATA32_POSITION               0x00000002
#define _SENT2DATH_DATA32_MASK                   0x00000004
#define _SENT2DATH_DATA32_LENGTH                 0x00000001

#define _SENT2DATH_DATA33_POSITION               0x00000003
#define _SENT2DATH_DATA33_MASK                   0x00000008
#define _SENT2DATH_DATA33_LENGTH                 0x00000001

#define _SENT2DATH_DATA20_POSITION               0x00000004
#define _SENT2DATH_DATA20_MASK                   0x00000010
#define _SENT2DATH_DATA20_LENGTH                 0x00000001

#define _SENT2DATH_DATA21_POSITION               0x00000005
#define _SENT2DATH_DATA21_MASK                   0x00000020
#define _SENT2DATH_DATA21_LENGTH                 0x00000001

#define _SENT2DATH_DATA22_POSITION               0x00000006
#define _SENT2DATH_DATA22_MASK                   0x00000040
#define _SENT2DATH_DATA22_LENGTH                 0x00000001

#define _SENT2DATH_DATA23_POSITION               0x00000007
#define _SENT2DATH_DATA23_MASK                   0x00000080
#define _SENT2DATH_DATA23_LENGTH                 0x00000001

#define _SENT2DATH_DATA10_POSITION               0x00000008
#define _SENT2DATH_DATA10_MASK                   0x00000100
#define _SENT2DATH_DATA10_LENGTH                 0x00000001

#define _SENT2DATH_DATA11_POSITION               0x00000009
#define _SENT2DATH_DATA11_MASK                   0x00000200
#define _SENT2DATH_DATA11_LENGTH                 0x00000001

