MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV128GM002/mcu.h
#define ICS_NONE             0x0080
#define ICS_PGD3             0x0081
#define ICS_PGD2             0x0082
#define ICS_PGD1             0x0083

/* Register FDMTINTVL (0x157ac)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTINTVL;
#define _FDMTINTVL(x) __attribute__((address(0x157ac),deprecated_definition("consider migrating to #pragma config"),section("__FDMTINTVL.sec"),space(prog))) __prog__ uint16_t _FDMTINTVL = (x);

/*
** Only one invocation of FDMTINTVL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTINTVL.
** Multiple options may be combined, as shown:
**
** _FDMTINTVL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 Bits of 32 Bit DMT Window Interval:
**     DMTIVTL_DMTIVTL      Lower 16 bits of 32 bit DMT window interval (0-0xFFFF)
**
*/

#define DMTIVTL_DMTIVTL      0x0000

/* Register FDMTINTVH (0x157b0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTINTVH;
#define _FDMTINTVH(x) __attribute__((address(0x157b0),deprecated_definition("consider migrating to #pragma config"),section("__FDMTINTVH.sec"),space(prog))) __prog__ uint16_t _FDMTINTVH = (x);

/*
** Only one invocation of FDMTINTVH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTINTVH.
** Multiple options may be combined, as shown:
**
** _FDMTINTVH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 Bits of 32 Bit DMT Window Interval:
**     DMTIVTH_DMTIVTH      Upper 16 bits of 32 bit DMT window interval (0-0xFFFF)
**
*/

#define DMTIVTH_DMTIVTH      0x0000

/* Register FDMTCNTL (0x157b4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTCNTL;
#define _FDMTCNTL(x) __attribute__((address(0x157b4),deprecated_definition("consider migrating to #pragma config"),section("__FDMTCNTL.sec"),space(prog))) __prog__ uint16_t _FDMTCNTL = (x);

/*
** Only one invocation of FDMTCNTL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTL.
** Multiple options may be combined, as shown:
**
** _FDMTCNTL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 Bits of 32 Bit DMT Instruction Count Time-Out Value:
**     DMTCNTL_DMTCNTL      Lower 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF)
**
*/

#define DMTCNTL_DMTCNTL      0x0000

/* Register FDMTCNTH (0x157b8)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTCNTH;
#define _FDMTCNTH(x) __attribute__((address(0x157b8),deprecated_definition("consider migrating to #pragma config"),section("__FDMTCNTH.sec"),space(prog))) __prog__ uint16_t _FDMTCNTH = (x);

/*
** Only one invocation of FDMTCNTH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTH.
** Multiple options may be combined, as shown:
**
** _FDMTCNTH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 Bits of 32 Bit DMT Instruction Count Time-Out Value:
**     DMTCNTH_DMTCNTH      Upper 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF)
**
*/

#define DMTCNTH_DMTCNTH      0x0000

/* Register FDMT (0x157bc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMT;
#define _FDMT(x) __attribute__((address(0x157bc),deprecated_definition("consider migrating to #pragma config"),section("__FDMT.sec"),space(prog))) __prog__ uint16_t _FDMT = (x);

/*
** Only one invocation of FDMT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMT.
** Multiple options may be combined, as shown:
**
** _FDMT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Enable Bit:
**     DMTEN_DISABLE        Dead Man Timer is Disabled and can be enabled by software
**     DMTEN_ENABLE         Dead Man Timer is Enabled and cannot be disabled by software
**
*/

#define DMTEN_DISABLE        0x0000
#define DMTEN_ENABLE         0x0001

/* Register FDEVOPT (0x157c0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT;
#define _FDEVOPT(x) __attribute__((address(0x157c0),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT.sec"),space(prog))) __prog__ uint16_t _FDEVOPT = (x);

/*
** Only one invocation of FDEVOPT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT.
** Multiple options may be combined, as shown:
**
** _FDEVOPT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   PWM Lock Enable Bit:
**     PWMLOCK_OFF          PWM registers may be written without key sequence
**     PWMLOCK_ON           Certain PWM registers may only be written after key sequence
**
**   Alternate I2C1 Pins Selection Bit:
**     ALTI2C1_ON           I2C1 mapped to ASDA1/ASCL1 pins
**     ALTI2C1_OFF          I2C1 mapped to SDA1/SCL1 pins
**
*/

#define PWMLOCK_OFF          0x000C
#define PWMLOCK_ON           0x000D

#define ALTI2C1_ON           0x0005
#define ALTI2C1_OFF          0x000D

/* Register FALTREG (0x157c4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FALTREG;
#define _FALTREG(x) __attribute__((address(0x157c4),deprecated_definition("consider migrating to #pragma config"),section("__FALTREG.sec"),space(prog))) __prog__ uint16_t _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Interrupt Priority Level (IPL) Selection Bits For Alternate Working Register Set 1:
**     CTXT1_IPL1           Alternate register set 1 assigned to IPL level 1
**     CTXT1_IPL2           Alternate register set 1 assigned to IPL level 2
**     CTXT1_IPL3           Alternate register set 1 assigned to IPL level 3
**     CTXT1_IPL4           Alternate register set 1 assigned to IPL level 4
**     CTXT1_IPL5           Alternate register set 1 assigned to IPL level 5
**     CTXT1_IPL6           Alternate register set 1 assigned to IPL level 6
**     CTXT1_IPL7           Alternate register set 1 assigned to IPL level 7
**     CTXT1_NONE           Not Assigned
**
**   Interrupt Priority Level (IPL) Selection Bits For Alternate Working Register Set 2:
**     CTXT2_IPL1           Alternate register set 2  assigned to IPL level 1
**     CTXT2_IPL2           Alternate register set 2  assigned to IPL level 2
**     CTXT2_IPL3           Alternate register set 2  assigned to IPL level 3
**     CTXT2_IPL4           Alternate register set 2  assigned to IPL level 4
**     CTXT2_IPL5           Alternate register set 2  assigned to IPL level 5
**     CTXT2_IPL6           Alternate register set 2  assigned to IPL level 6
**     CTXT2_IPL7           Alternate register set 2 assigned to IPL level 7
**     CTXT2_NONE           Not Assigned
**
*/

#define CTXT1_IPL1           0x0070
#define CTXT1_IPL2           0x0071
#define CTXT1_IPL3           0x0072
#define CTXT1_IPL4           0x0073
#define CTXT1_IPL5           0x0074
#define CTXT1_IPL6           0x0075
#define CTXT1_IPL7           0x0076
#define CTXT1_NONE           0x0077

#define CTXT2_IPL1           0x0007
#define CTXT2_IPL2           0x0017
#define CTXT2_IPL3           0x0027
#define CTXT2_IPL4           0x0037
#define CTXT2_IPL5           0x0047
#define CTXT2_IPL6           0x0057
#define CTXT2_IPL7           0x0067
#define CTXT2_NONE           0x0077



